# ConduitSizeSettingIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConduitSizeSettingIterator Properties
ConduitSizeSettingIterator Class See Also
---
The ConduitSizeSettingIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets the item at the current position of the iterator. |
| CurrentObject |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ConduitSizeSettingIterator Class
Autodesk.Revit.DB.Electrical Namespace